---
kind: other
id: Methods.T:Autodesk.Revit.DB.Mechanical.FlexDuct
source: html/18e19443-7a35-dbd0-e6a6-4ded5d5c8bd8.htm
---
# FlexDuct Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.